<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"prod","backend":"91c47f532f19d1dbaca9c45366bc46d708d6d97b5c62e93cac3c0e1ff9c1e979","plan_job_ref":"Job Environment Prod - Plan #128 at https://github.com/jarrod-lowe/dnd-planner/actions/runs/23394978784","plan_out_hash":"57ca6d54313ca41f124565ba54f9d2f954ff091c0dc3cc1531b3f900d81130ac","plan_hash":"618d38906c0afe18f5ce1da02175d996042bea000f03649bed8e07801ab44ad9","plan_text_format":"diff","version":"1.49.0","closed":true} -->
Terraform plan for __prod__
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.dnd-planner.aws_api_gateway_account.main will be updated in-place
!~  resource "aws_api_gateway_account" "main" {
!~      api_key_version     = "*" -> (known after apply)
!~      cloudwatch_role_arn = "arn:aws:iam::021891603679:role/dnd-planner-test-api-logging" -> "arn:aws:iam::021891603679:role/dnd-planner-prod-api-logging"
!~      features            = [
-           "UsagePlans",
        ] -> (known after apply)
        id                  = "021891603679"
!~      throttle_settings   = [
-           {
-               burst_limit = 5000
-               rate_limit  = 10000
            },
        ] -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.dnd-planner.aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
!~      created_date = "2026-03-22T01:05:12Z" -> (known after apply)
!~      id           = "******" -> (known after apply)
!~      triggers     = { # forces replacement
!~          "redeployment" = "2ac08569e700e801e3edc4f78a2c01a0f339cc6e17b6c35e5104451cea731e4d" -> "2c79134fc1cfc29be443a8b0a1c332367d66626ffd34cf6475d3961955a0130d"
        }
#        (3 unchanged attributes hidden)
    }

  # module.dnd-planner.aws_api_gateway_rest_api.api will be updated in-place
!~  resource "aws_api_gateway_rest_api" "api" {
!~      body                         = <<-EOT
            openapi: 3.0.3
            info:
              title: D&D Planner API
              version: 1.0.0
              description: API for D&D Planner application
            
            x-amazon-apigateway-request-validators:
              all:
                validateRequestBody: true
                validateRequestParameters: true
            
            x-amazon-apigateway-request-validator: all
            
            components:
              securitySchemes:
                CognitoAuthorizer:
                  type: apiKey
                  name: Authorization
                  in: header
                  x-amazon-apigateway-authtype: cognito_user_pools
                  x-amazon-apigateway-authorizer:
                    type: cognito_user_pools
                    providerARNs:
                      - 'arn:aws:cognito-idp:ap-southeast-2:021891603679:userpool/ap-southeast-2_xuX7cYL7r'
            
            # All endpoints require Cognito authentication
            security:
              - CognitoAuthorizer: []
            
            paths:
              /health:
                get:
                  summary: Health check endpoint
                  description: Returns the health status of the API
                  operationId: getHealth
                  responses:
                    '200':
                      description: Successful health check
                      content:
                        application/json:
                          schema:
                            type: object
                            properties:
                              status:
                                type: string
                                example: ok
                  x-amazon-apigateway-integration:
                    type: mock
                    requestTemplates:
                      application/json: '{"statusCode": 200}'
                    responses:
                      default:
                        statusCode: 200
                        responseTemplates:
                          application/json: '{"status": "ok"}'
            
              /test:
                get:
                  summary: Test endpoint
                  description: Returns a test response to verify Lambda integration
                  operationId: getTest
                  requestBody:
                    content: {}
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            type: object
                            properties:
                              status:
                                type: string
                                example: ok
                  x-amazon-apigateway-integration:
                    type: aws_proxy
                    httpMethod: POST
                    uri: 'arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:021891603679:function:dnd-planner-prod-test-handler/invocations'
            
              /user:
                get:
                  summary: Get current user data
                  description: Returns all data (META and characters) for the authenticated user
                  operationId: getUser
                  responses:
                    '200':
                      description: User data retrieved successfully
                      content:
                        application/json:
                          schema:
                            type: array
                            items:
                              type: object
                    '404':
                      description: User not found
                      content:
                        application/json:
                          schema:
                            type: object
                            properties:
                              error:
                                type: string
                  x-amazon-apigateway-integration:
                    type: aws
                    credentials: 'arn:aws:iam::021891603679:role/dnd-planner-prod-api-dynamodb'
                    uri: 'arn:aws:apigateway:ap-southeast-2:dynamodb:action/Query'
                    httpMethod: POST
                    requestTemplates:
                      application/json: |
                        {
                          "TableName": "dnd-planner-prod-data",
                          "KeyConditionExpression": "PK = :pk",
                          "ExpressionAttributeValues": {
                            ":pk": {"S": "USER#$context.authorizer.claims.sub"}
                          }
                        }
                    responses:
                      default:
                        statusCode: 200
                        responseTemplates:
                          application/json: |
                            #set($items = $input.path('$.Items'))
                            #if($items.size() == 0)
                            #set($context.responseOverride.status = 404)
                            {"error": "User not found"}
                            #else
                            [
                            #set($itemHasNext = false)
                            #foreach($item in $items)
                              #if($itemHasNext), #end
                              #set($itemHasNext = true)
                              {
                              #set($first = true)
                              #foreach($key in $item.keySet())
                                #if($key != "PK" && $key != "SK")
                                  #if($first)
                                  #set($first = false)
                                  #else
                                  ,
                                  #end
                                  #set($typed = $item.get($key))
                                  #set($val = "")
                                  #if($typed.containsKey("S"))
                                  #set($val = $typed.get("S"))
                                  "$key": "$val"
                                  #elseif($typed.containsKey("N"))
                                  #set($val = $typed.get("N"))
                                  "$key": $val
                                  #elseif($typed.containsKey("BOOL"))
                                  #set($val = $typed.get("BOOL"))
                                  "$key": $val
                                  #elseif($typed.containsKey("NULL"))
                                  "$key": null
                                  #elseif($typed.containsKey("L"))
                                  #set($val = $typed.get("L"))
                                  "$key": $val
                                  #elseif($typed.containsKey("M"))
                                  #set($val = $typed.get("M"))
                                  "$key": $val
                                  #else
                                  "$key": $util.toJson($typed)
                                  #end
                                #end
                              #end
                              }
                            #end
                            ]
                            #end
          + 
          +   /characters/{characterId}/rule-groups:
          +     get:
          +       summary: Get rule groups for a character
          +       description: Returns all rule group IDs assigned to a character (must be owned by authenticated user)
          +       operationId: getCharacterRuleGroups
          +       parameters:
          +         - name: characterId
          +           in: path
          +           required: true
          +           schema:
          +             type: string
          +       responses:
          +         '200':
          +           description: Rule groups retrieved successfully
          +           content:
          +             application/json:
          +               schema:
          +                 type: object
          +                 properties:
          +                   userId:
          +                     type: string
          +                   characterId:
          +                     type: string
          +                   ruleGroups:
          +                     type: array
          +                     items:
          +                       type: string
          +         '403':
          +           description: Forbidden - character not found or not owned by user
          +           content:
          +             application/json:
          +               schema:
          +                 type: object
          +                 properties:
          +                   error:
          +                     type: string
          +       x-amazon-apigateway-integration:
          +         type: aws
          +         credentials: 'arn:aws:iam::021891603679:role/dnd-planner-prod-api-dynamodb'
          +         uri: 'arn:aws:apigateway:ap-southeast-2:dynamodb:action/Query'
          +         httpMethod: POST
          +         requestTemplates:
          +           application/json: |
          +             {
          +               "TableName": "dnd-planner-prod-data",
          +               "KeyConditionExpression": "PK = :pk AND begins_with(SK, :skPrefix)",
          +               "FilterExpression": "userId = :userId",
          +               "ExpressionAttributeValues": {
          +                 ":pk": {"S": "CHAR#$input.params('characterId')"},
          +                 ":skPrefix": {"S": "RULEGROUP#"},
          +                 ":userId": {"S": "$context.authorizer.claims.sub"}
          +               }
          +             }
          +         responses:
          +           default:
          +             statusCode: 200
          +             responseTemplates:
          +               application/json: |
          +                 #set($items = $input.path('$.Items'))
          +                 #if($items.size() == 0)
          +                 #set($context.responseOverride.status = 403)
          +                 {"error": "Forbidden"}
          +                 #else
          +                 {
          +                   "userId": "$context.authorizer.claims.sub",
          +                   "characterId": "$input.params('characterId')",
          +                   "ruleGroups": [
          +                 #set($first = true)
          +                 #foreach($item in $items)
          +                   #if($first)
          +                   #set($first = false)
          +                   #else
          +                   ,
          +                   #end
          +                   "$item.get('ruleGroupId').get('S')"
          +                 #end
          +                   ]
          +                 }
          +                 #end
        EOT
        id                           = "5ephduxi7f"
        name                         = "dnd-planner-prod-api"
        tags                         = {
            "Name" = "dnd-planner-prod-api"
        }
#        (12 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.dnd-planner.aws_api_gateway_stage.default will be updated in-place
!~  resource "aws_api_gateway_stage" "default" {
!~      deployment_id         = "******" -> (known after apply)
        id                    = "ags-5ephduxi7f-api"
        tags                  = {
            "Name" = "dnd-planner-prod-api-api"
        }
#        (15 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Environment Prod - Deploy #50](https://github.com/jarrod-lowe/dnd-planner/actions/runs/23395002261)
<details><summary>Outputs</summary>

```hcl
api_endpoint               = "https://5ephduxi7f.execute-api.ap-southeast-2.amazonaws.com/api"
cdn_domain_name            = "d2af406ilxdpfy.cloudfront.net"
cdn_nice_domain            = "dnd-planner.wildsea.lowe.kiwi"
cloudfront_distribution_id = "E3JHYKQXZWAEYT"
cognito_identity_pool_id   = "ap-southeast-2:975c5e55-32fe-49ab-8969-6eb235c71f7e"
cognito_login_domain       = "dnd-planner-prod.auth.ap-southeast-2.amazoncognito.com"
cognito_user_pool_id       = "ap-southeast-2_xuX7cYL7r"
cognito_web_client_id      = "1m7r1l2masqs9rldjt14cct33u"
dynamodb_table_arn         = "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data"
dynamodb_table_name        = "dnd-planner-prod-data"
s3_bucket_arn              = "arn:aws:s3:::dnd-planner-prod-ui"
s3_bucket_name             = "dnd-planner-prod-ui"
```
</details>